#### Data of cars that haven't been downloaded from IDAE. Get this cars in order to scrape their data.

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

engine_titles = create_engine('sqlite:///idae_titles.db')
engine_merged = create_engine('sqlite:///merged_idae.db')

df_titles = pd.read_sql('cars', engine_titles)
df_merged = pd.read_sql('cars', engine_merged)

In [2]:
not_in_titles = df_titles[~df_titles['Nombre'].isin(df_merged['Nombre'])]

In [3]:
not_in_titles

                                                  Nombre
872    Audi A5 SPORTBACK MY18 2.0 TDI MAN. 6V 140KW (...
1436   BMW M4 Coupe M4 Automatico (F82) (CO2 194) (3R...
1437   BMW M4 Coupe M4 Automatico (F82) (CO2 194) (3R...
1438   BMW M4 GTS Coupe M4 GTS Automatico (F82) (CO2 ...
1827   BMW Serie 2 Cabrio 228i Grupo 1 (F23) (CO2 159...
...                                                  ...
19233                                         ZD D2S 0,1
19234                         ZERO MOTORCYCLES DS ZF11Kw
19235                          ZERO MOTORCYCLES FX ZF6.5
19236                        ZERO MOTORCYCLES FXS ZF11Kw
19237                          ZERO MOTORCYCLES S ZF11Kw

[306 rows x 1 columns]

In [4]:
not_in_titles.to_excel('not_in_titles.xlsx')

In [3]:
not_in_titles.to_csv('not_in_titles.csv')

In [5]:
df = pd.read_csv('not_in_titles.csv')

In [6]:
df.head()

   Unnamed: 0                                             Nombre
0         872  Audi A5 SPORTBACK MY18 2.0 TDI MAN. 6V 140KW (...
1        1436  BMW M4 Coupe M4 Automatico (F82) (CO2 194) (3R...
2        1437  BMW M4 Coupe M4 Automatico (F82) (CO2 194) (3R...
3        1438  BMW M4 GTS Coupe M4 GTS Automatico (F82) (CO2 ...
4        1827  BMW Serie 2 Cabrio 228i Grupo 1 (F23) (CO2 159...